lucaslpmoura/imxrt1050-evkb-test-program/source/SerialConsole_LEDControl.c
/*
 * Copyright 2016-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**
 * @file    SerialConsole_LEDControl.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "fsl_debug_console.h"

#include "hardware_init.h"
#include "led.h"
/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */
#define CARRIAGE_RETURN PUTCHAR('\r')
#define NOT_IMPLEMENTED PRINTF("\r\nNot Implemented!\n");

typedef enum{
	USER,
	BLINKING
} led_control_state_t;


/*
 * @brief Prints the options menu
 */
void Print_Menu(led_control_state_t led_control_state){
	CARRIAGE_RETURN;
	PRINTF("-----MENU-----\n");
	CARRIAGE_RETURN;
	PRINTF("(1) Turn On LED\n");
	CARRIAGE_RETURN;
	PRINTF("(2) Turn Off LED\n");
	CARRIAGE_RETURN;

	if(led_control_state == USER){
		PRINTF("(3) Start Blinking LED\n");
	}
	if(led_control_state == BLINKING){
		PRINTF("(3) Stop Blinking LED\n");
	}


	CARRIAGE_RETURN;
	PRINTF("(4) Quit Program\n");
	CARRIAGE_RETURN;
}

void LedControlState_Toggle(led_control_state_t *led_control_state){
	if(*led_control_state == USER){
		*led_control_state = BLINKING;
		return;
	}
	if(*led_control_state == BLINKING){
		*led_control_state = USER;
		return;
	}
}

/*
 * @brief   Application entry point.
 */
int main(void) {

	bool running = true;
	char option = '0';
	char *farewellMessage = "\r\n Terminating program.";
	led_control_state_t led_control_state = USER;

	BOARD_InitHardware();
	Led_TurnOff();


    Print_Menu(led_control_state);

    while(running){
    	option = GETCHAR();

    	PUTCHAR('\r');
    	PUTCHAR('\n');
    	PUTCHAR(option);
    	switch(option){
    	case '1':
        	Print_Menu(led_control_state);
        	PRINTF("\n Turning Led On...");
        	Led_TurnOn();
    		break;
    	case '2':
        	Print_Menu(led_control_state);
        	PRINTF("\n Turning Led Off...");
        	Led_TurnOff();
    		break;
    	case '3':
       		LedControlState_Toggle(&led_control_state);
    		Print_Menu(led_control_state);
    		if(led_control_state == USER){
    			PRINTF("\n Stopped blinking Led.\n");
    		}

    		break;
    	case '4':
    		running = false;
    		break;
    	default:
    		PRINTF("\r\nPlease enter an valid option.\n");
    		break;
    	}
    }

    PRINTF(farewellMessage);
    Led_TurnOff();


}
